In [26]:
import pandas as pd

In [27]:
import matplotlib.pyplot as plt

In [28]:
data_set=pd.read_csv('Nepali_house_dataset.csv',usecols=['TITLE','LOCATION','PRICE'
])

In [29]:
data_set

                        TITLE                     LOCATION           PRICE
0              House for Sale             Imadol, Lalitpur     Rs. 2.9 Cr
1              House for Sale          Satdobato, Lalitpur    Rs. 4.75 Cr
2        4 BHK House for Sale             Imadol, Lalitpur    Rs. 1.99 Cr
3     Bungalow House for Sale         Bhaisepati, Lalitpur       Rs. 4 Cr
4              House for Rent       Maharajgunj, Kathmandu    Rs. 12000000
...                       ...                          ...             ...
3413   Padma Colony Phase III        Sitapiala,  Kathmandu  Rs. 26,000,000
3414    Bhatbhateni Apartment      Bhatbhateni,  Kathmandu  Rs. 30,000,000
3415                स्यूचाटार        Syuchatar,  Kathmandu    Rs. 16000000
3416    Sano Bharayang Colony   Sano Bharayang,  Kathmandu      Rs. 3.5 Cr
3417   Buddhanilkatha Banglow   Budhanilkantha,  Kathmandu    Rs. 48000000

[3418 rows x 3 columns]

In [30]:
data_set.info

<bound method DataFrame.info of                         TITLE                     LOCATION           PRICE
0              House for Sale             Imadol, Lalitpur     Rs. 2.9 Cr
1              House for Sale          Satdobato, Lalitpur    Rs. 4.75 Cr
2        4 BHK House for Sale             Imadol, Lalitpur    Rs. 1.99 Cr
3     Bungalow House for Sale         Bhaisepati, Lalitpur       Rs. 4 Cr
4              House for Rent       Maharajgunj, Kathmandu    Rs. 12000000
...                       ...                          ...             ...
3413   Padma Colony Phase III        Sitapiala,  Kathmandu  Rs. 26,000,000
3414    Bhatbhateni Apartment      Bhatbhateni,  Kathmandu  Rs. 30,000,000
3415                स्यूचाटार        Syuchatar,  Kathmandu    Rs. 16000000
3416    Sano Bharayang Colony   Sano Bharayang,  Kathmandu      Rs. 3.5 Cr
3417   Buddhanilkatha Banglow   Budhanilkantha,  Kathmandu    Rs. 48000000

[3418 rows x 3 columns]>

In [31]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3418 entries, 0 to 3417
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   TITLE     3418 non-null   object
 1   LOCATION  3418 non-null   object
 2   PRICE     3418 non-null   object
dtypes: object(3)
memory usage: 80.2+ KB

In [32]:
data_set.shape

(3418, 3)

In [33]:
data_set.sample(5)

,TITLE,LOCATION,PRICE
2732,"Commercial house on sale in Patitar, Guheshwor...","Patitar, Kathmandu",Rs. 6.7 Cr
1688,Commercial building for rent at Jhamsikhel,"Jhamsikhel, Lalitpur",Rs. 1.9 Lac/m
2437,"Bungalow house for sale at Ganesh Chowk, Budha...","Ganesh Chowk, Kathmandu",Rs. 3.25 Cr
3302,Kohinoor House for Sale,"Bafal, Kathmandu",Rs. 40000000
1582,"Furnished bungalow for rent in Chapali, Bhadra...","Chapali, Kathmandu","Rs. 95,000 /m"

In [34]:
data_set.isnull().sum()

TITLE       0
LOCATION    0
PRICE       0
dtype: int64

In [35]:
data_set.describe()

                  TITLE          LOCATION          PRICE
count              3418              3418           3418
unique             2895               514            537
top      House for Sale  Imadol, Lalitpur  Price on call
freq                183               234            188

In [36]:
data_set.duplicated().sum()

np.int64(43)